DataProcessors/бит_ВыгрузкаВГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ВыгрузкаВГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидВыгрузкиГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСтраницыExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаНач1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаНач2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаНач3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогНач1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогНач2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогНач3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизацииВладельцаЖилФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизацииПредоставившейСведенияОНачислениях</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКолонокExcel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_ИмяФайлаКвартиросъемщики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_ИмяФайлаОплатыУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_ИмяФайлаСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>кр_Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйФорматВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиExcel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РегионыВыгрузкиВГЦЖС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлExcel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_НастройкиУслугВыгрузкиГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиУслугВыгрузкиГЦЖС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоГУГЦЖСОбщеДом</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоГУГЦЖС_КПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоГУГЦЖС_ДПУ</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоГУГЦЖС_Разовые</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьТариф</Name>
					<Comment>(Настройка выгрузки льготы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетВременноПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_СписокУлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СписокУлиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтароеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖСБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУлицы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыУлицы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУлицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонГород</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АдминистративныеОкруга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатусыКвартиры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатусыКвартиры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СписокЛьгот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СписокЛьгот</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыПодтверждающиеЛьготу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПерсонификации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийИдентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированноеКоличествоЧеловекПользующихсяЛьготой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостановлениеОЛьготе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПостановленияПоЛьготам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ВыгрузкаВГЦЖС/Forms/ФормаНастройки/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ЦветЛинииОтчета", ЦветаСтиля.ЦветЛинииОтчета);
	КэшированныеЗначения.Вставить("ЦветФонаКнопки" , ЦветаСтиля.ЦветФонаКнопки);
	
	КэшированныеЗначения.Вставить("КвартираПустаяСсылка", Справочники.бит_Квартиры.ПустаяСсылка());
	КэшированныеЗначения.Вставить("ЗданиеПустаяСсылка"   , Справочники.бит_СписокЗданий.ПустаяСсылка());
	
КонецПроцедуры

// БИТ_ЖКХ 04.10.2011
//
&НаСервере
Процедура ВыполнитьПроверкуИЗапись(Записать = Ложь)
	
	Корень = СписокУслуг.ПолучитьЭлементы();
	
	Для каждого СтрокаГруппы Из Корень Цикл
		
		НаборЗаписей = РегистрыСведений.бит_НастройкиУслугВыгрузкиГЦЖС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Услуга.Установить(СтрокаГруппы.Услуга, Истина);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаГруппы);
		
		Группа = СтрокаГруппы.ПолучитьЭлементы();
		
		Для каждого СтрокаТаблицы Из Группа Цикл
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
			Запись.Услуга = СтрокаГруппы.Услуга;
			
		КонецЦикла; 
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла; 
	
	Для каждого Строка Из СписокРайонов Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Районы и/или города"": ";
			
			ЭлСправочника = Строка.Район.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Строка Из СписокЛьгот Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС 
			ИЛИ НЕ Строка.НовоеФиксированноеКоличествоЧеловекПользующихсяЛьготой = Строка.СтароеФиксированноеКоличествоЧеловекПользующихсяЛьготой Тогда
			
			Заголовок = "Справочник ""Список льгот"": ";
			
			ЭлСправочника = Строка.Льгота.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			ЭлСправочника.ФиксированноеКоличествоЧеловекПользующихсяЛьготой = Строка.НовоеФиксированноеКоличествоЧеловекПользующихсяЛьготой;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Строка Из СписокУлиц Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС
			ИЛИ НЕ Строка.НовыйКодГЦЖСБТИ = Строка.СтарыйКодГЦЖСБТИ Тогда
			
			Заголовок = "Справочник ""Список улиц"": ";
			
			ЭлСправочника = Строка.Улица.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС    = Строка.НовыйКодГЦЖС;
			ЭлСправочника.КодПоГУГЦЖСБТИ = Строка.НовыйКодГЦЖСБТИ;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого Строка Из СписокТиповУлицы Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС  Тогда
			
			Заголовок = "Справочник ""Типы улицы"": ";
			
			ЭлСправочника = Строка.ТипУлицы.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС    = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого Строка Из СписокУдостовиренийЛичности Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Документы удостоверяющие личность"": ";
			
			ЭлСправочника = Строка.ВидДокумента.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого Строка Из СписокДокументовНаЛьготу Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Документы подтверждающие льготу"": ";
			
			ЭлСправочника = Строка.ВидДокумента.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Строка Из СписокЖилишныхФондов Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Документы подтверждающие льготу"": ";
			
			ЭлСправочника = Строка.ТипЖилищногоФонда.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого Строка Из СписокСтатусовКвартиры Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС ИЛИ НЕ Строка.НовыйПредставлениеПоГУГЦЖС = Строка.СтарыйПредставлениеПоГУГЦЖС Тогда
			
			Заголовок = "Справочник ""Статусы квартиры"": ";
			
			ЭлСправочника = Строка.СтатусКвартиры.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС           = Строка.НовыйКодГЦЖС;
			ЭлСправочника.ПредставлениеПоГУГЦЖС = Строка.НовыйПредставлениеПоГУГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Строка Из СписокТиповКвартиры Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Типы квартиры"": ";
			
			ЭлСправочника = Строка.ТипКвартиры.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Строка Из СписокКодовПлательщиков Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Лицевые счета"": ";
			
			ЭлСправочника = Строка.ЛицевойСчет.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	
	Для каждого Строка Из СписокПоставщиков Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Поставщики услуг"": ";
			
			ЭлСправочника = Строка.Поставщик.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Строка Из СписокСтепениРодстваФизЛиц Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Степени родства физлиц"": ";
			
			ЭлСправочника = Строка.СтепеньРодства.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	
	// БИТ_ЖКХ 10.04.2014
	Для каждого Строка Из СписокСтатусовФизическихЛиц Цикл
		Если НЕ Строка.НовыйКодГЦЖС = Строка.СтарыйКодГЦЖС Тогда
			
			Заголовок = "Справочник ""Статусы физлиц"": ";
			
			ЭлСправочника = Строка.СтатусФизическогоЛица.ПолучитьОбъект();
			ЭлСправочника.КодПоГУГЦЖС = Строка.НовыйКодГЦЖС;
			бит_ОбщегоНазначения.ЗаписатьСправочник(ЭлСправочника,Заголовок,,Истина);
			
		КонецЕсли; 
	КонецЦикла;
	// БИТ_ЖКХ 10.04.2014
	
КонецПроцедуры

// БИТ_ЖКХ 04.10.2011
//
&НаСервере
Процедура ОбновитьТаблицы()
	
	СписокДокументовНаЛьготу.Очистить();
	СписокЖилишныхФондов.Очистить();
	СписокРайонов.Очистить();
	СписокСтатусовКвартиры.Очистить();
	СписокТиповКвартиры.Очистить();
	СписокУдостовиренийЛичности.Очистить();
	СписокУлиц.Очистить();
	СписокУслуг.ПолучитьЭлементы().Очистить();
	СписокПоставщиков.Очистить();
	СписокСтепениРодстваФизЛиц.Очистить();
	СписокТиповУлицы.Очистить();
	
	// БИТ_ЖКХ 12.07.2013 Начало
	СписокСтатусовФизическихЛиц.Очистить();
	// БИТ_ЖКХ 12.07.2013 Окончание
	
	Запрос = Новый Запрос;
	
	// Районы.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_АдминистративныеОкруга.Ссылка КАК Район,
	|	бит_АдминистративныеОкруга.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_АдминистративныеОкруга.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга";
	
	СписокРайонов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Типы улицы.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ТипыУлицы.Ссылка КАК ТипУлицы,
	|	бит_ТипыУлицы.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_ТипыУлицы.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_ТипыУлицы КАК бит_ТипыУлицы";
	
	СписокТиповУлицы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Улицы.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СписокУлиц.Ссылка КАК Улица,
	|	бит_СписокУлиц.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_СписокУлиц.КодПоГУГЦЖС КАК СтарыйКодГЦЖС,
	|	бит_СписокУлиц.КодПоГУГЦЖСБТИ КАК СтарыйКодГЦЖСБТИ,
	|	бит_СписокУлиц.КодПоГУГЦЖСБТИ КАК НовыйКодГЦЖСБТИ
	|ИЗ
	|	Справочник.бит_СписокУлиц КАК бит_СписокУлиц";
	
	СписокУлиц.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Жилищные фонды.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ТипыЖилогоФонда.Ссылка КАК ТипЖилищногоФонда,
	|	бит_ТипыЖилогоФонда.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_ТипыЖилогоФонда.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_ТипыЖилогоФонда КАК бит_ТипыЖилогоФонда";
	
	СписокЖилишныхФондов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Типы квартир.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ТипыКвартиры.Ссылка КАК ТипКвартиры,
	|	бит_ТипыКвартиры.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_ТипыКвартиры.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_ТипыКвартиры КАК бит_ТипыКвартиры";
	
	СписокТиповКвартиры.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Статусы квартир.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатусыКвартиры.Ссылка КАК СтатусКвартиры,
	|	бит_СтатусыКвартиры.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_СтатусыКвартиры.КодПоГУГЦЖС КАК СтарыйКодГЦЖС,
	|	бит_СтатусыКвартиры.ПредставлениеПоГУГЦЖС КАК НовыйПредставлениеПоГУГЦЖС,
	|	бит_СтатусыКвартиры.ПредставлениеПоГУГЦЖС КАК СтарыйПредставлениеПоГУГЦЖС
	|ИЗ
	|	Справочник.бит_СтатусыКвартиры КАК бит_СтатусыКвартиры";
	
	СписокСтатусовКвартиры.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Документы удостоверяющие личность.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыУдостоверяющиеЛичность.Ссылка КАК ВидДокумента,
	|	ДокументыУдостоверяющиеЛичность.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	ДокументыУдостоверяющиеЛичность.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность";
	
	СписокУдостовиренийЛичности.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Документы подтверждающие льготу.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ДокументыПодтверждающиеЛьготу.Ссылка КАК ВидДокумента,
	|	бит_ДокументыПодтверждающиеЛьготу.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_ДокументыПодтверждающиеЛьготу.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_ДокументыПодтверждающиеЛьготу КАК бит_ДокументыПодтверждающиеЛьготу";
	
	СписокДокументовНаЛьготу.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//  Список льгот.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СписокЛьгот.Ссылка КАК Льгота,
	|	бит_СписокЛьгот.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_СписокЛьгот.КодПоГУГЦЖС КАК СтарыйКодГЦЖС,
	|	бит_СписокЛьгот.ФиксированноеКоличествоЧеловекПользующихсяЛьготой КАК НовоеФиксированноеКоличествоЧеловекПользующихсяЛьготой,
	|	бит_СписокЛьгот.ФиксированноеКоличествоЧеловекПользующихсяЛьготой КАК СтароеФиксированноеКоличествоЧеловекПользующихсяЛьготой
	|ИЗ
	|	Справочник.бит_СписокЛьгот КАК бит_СписокЛьгот";
	
	СписокЛьгот.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Услуги.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_УслугиЖКХ.Ссылка КАК Услуга,
	|	бит_УслугиЖКХРежимыПотребленияУслуг.РежимПотребленияУслуг КАК РежимПотребления,
	|	бит_УслугиЖКХ.ОсновнойРежимПотребления
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_УслугиЖКХ.РежимыПотребленияУслуг КАК бит_УслугиЖКХРежимыПотребленияУслуг
	|		ПО бит_УслугиЖКХ.Ссылка = бит_УслугиЖКХРежимыПотребленияУслуг.Ссылка
	|ГДЕ
	|	НЕ бит_УслугиЖКХ.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокУслуг.Услуга КАК Услуга,
	|	СписокУслуг.РежимПотребления,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.КодПоГУГЦЖС,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.КодПоГУГЦЖСОбщеДом,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.КодПоГУГЦЖС_КПУ,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.КодПоГУГЦЖС_ДПУ,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.КодПоГУГЦЖС_Разовые,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.ИспользоватьТариф,
	|	СписокУслуг.Услуга.Приоритет КАК Приоритет,
	|	СписокУслуг.ОсновнойРежимПотребления КАК ОсновнойРежимПотребления,
	|	бит_НастройкиУслугВыгрузкиГЦЖС.УчетВременноПроживающих
	|ИЗ
	|	СписокУслуг КАК СписокУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиУслугВыгрузкиГЦЖС КАК бит_НастройкиУслугВыгрузкиГЦЖС
	|		ПО СписокУслуг.Услуга = бит_НастройкиУслугВыгрузкиГЦЖС.Услуга
	|			И СписокУслуг.РежимПотребления = бит_НастройкиУслугВыгрузкиГЦЖС.РежимПотребления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокУслуг";
	
	ВыборкаУС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Корень = СписокУслуг.ПолучитьЭлементы();
	
	Пока ВыборкаУС.Следующий() Цикл
		
		Если ВыборкаУС.Услуга.РежимыПотребленияУслуг.Количество() > 0 Тогда 
			
			ГруппаУслуги = Корень.Добавить();
			
			Выборка = ВыборкаУС.Выбрать();
			
			Услуга = ГруппаУслуги.ПолучитьЭлементы();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.РежимПотребления = Выборка.ОсновнойРежимПотребления Тогда
					ЗаполнитьЗначенияСвойств(ГруппаУслуги, Выборка);
					Продолжить;
				КонецЕсли; 
				
				СтрокаУслуги =  Услуга.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаУслуги, Выборка);
				СтрокаУслуги.Услуга = Неопределено;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Поставщики услуг.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПоставщикиУслуг.Ссылка КАК Поставщик,
	|	бит_ПоставщикиУслуг.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_ПоставщикиУслуг.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_ПоставщикиУслуг КАК бит_ПоставщикиУслуг";
	
	СписокПоставщиков.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Степени родства физлиц.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтепениРодстваФизЛиц.Ссылка КАК СтепеньРодства,
	|	бит_СтепениРодстваФизЛиц.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_СтепениРодстваФизЛиц.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_СтепениРодстваФизЛиц КАК бит_СтепениРодстваФизЛиц";
	
	СписокСтепениРодстваФизЛиц.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Статусы физических лиц.
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатусФизЛица.Ссылка КАК СтатусФизическогоЛица,
	|	бит_СтатусФизЛица.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_СтатусФизЛица.КодПоГУГЦЖС КАК СтарыйКодГЦЖС
	|ИЗ
	|	Справочник.бит_СтатусФизЛица КАК бит_СтатусФизЛица";
	
	СписокСтатусовФизическихЛиц.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ПолучитьТаблицуЛицевыхСчетов();	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

// БИТ_ЖКХ 04.10.2011
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТаблицы();
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандныхПанелейФормы

// БИТ_ЖКХ 04.10.2011
//
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ВыполнитьПроверкуИЗапись();
	Закрыть();
	
КонецПроцедуры

// БИТ_ЖКХ 04.10.2011
//
&НаКлиенте
Процедура Записать(Команда)
	
	ВыполнитьПроверкуИЗапись();
	ОбновитьТаблицы();
	
КонецПроцедуры

// БИТ_ЖКХ 04.10.2011
//
&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьТаблицы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// БИТ_ЖКХ 04.10.2011
//
&НаКлиенте
Процедура ПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// БИТ_ЖКХ 04.10.2011
//
&НаКлиенте
Процедура ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	Здание   = мКэшЗначений.ЗданиеПустаяСсылка;
	Квартира = мКэшЗначений.КвартираПустаяСсылка;
	ПолучитьТаблицуЛицевыхСчетов();
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеПриИзменении(Элемент)
	Квартира = мКэшЗначений.КвартираПустаяСсылка;
	ПолучитьТаблицуЛицевыхСчетов();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	ПолучитьТаблицуЛицевыхСчетов();
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтркутураПараметров = Новый Структура("Улица", Улица);
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор",СтркутураПараметров),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтркутураПараметров = Новый Структура("Владелец", Здание);
	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбора", Новый Структура("Отбор", СтркутураПараметров),Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура УстановитьКодВсе(Команда)
	
	Для каждого СтрокаТаблицы Из СписокКодовПлательщиков Цикл
		
		// БИТ_ЖКХ 16.12.2014{{
		Если СтрДлина(СтрокаТаблицы.ЛицевойСчет) <= 10 Тогда
			
			СтрокаТаблицы.НовыйКодГЦЖС = Строка(СтрокаТаблицы.ЛицевойСчет);
			// БИТ_ЖКХ 16.12.2014}}	
			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Длина наименования лицевого счета: "+СтрокаТаблицы.ЛицевойСчет+" превышает 10 символов(Длина кода ГКУ ИС).");
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоТекущейСтроке(Команда)
	
	ТекущиеДанные = Элементы.СписокКодовПлательщиков.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		// БИТ_ЖКХ 16.12.2014{{
		Если СтрДлина(ТекущиеДанные.ЛицевойСчет) <= 10 Тогда
			ТекущиеДанные.НовыйКодГЦЖС =  Строка(ТекущиеДанные.ЛицевойСчет);
			// БИТ_ЖКХ 16.12.2014}}	
			
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Длина наименования лицевого счета: "+ТекущиеДанные.ЛицевойСчет+" превышает 10 символов(Длина кода ГКУ ИС).");
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоТаблице(Команда)
	
	Для каждого СтрокаТаблицы Из СписокКодовПлательщиков Цикл
		СтрокаТаблицы.НовыйКодГЦЖС = "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоСтроке(Команда)
	ТекущиеДанные = Элементы.СписокКодовПлательщиков.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.НовыйКодГЦЖС = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТаблицуЛицевыхСчетов()
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.КодПоГУГЦЖС КАК НовыйКодГЦЖС,
	|	бит_ЛицевыеСчета.КодПоГУГЦЖС КАК СтарыйКодГЦЖС,
	|	бит_ЛицевыеСчета.Наименование КАК Наименование,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Квартира
	|{ВЫБРАТЬ
	|	Здание.*,
	|	УлицаЛицевогоСчета.*,
	|	Квартира.*}
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|{ГДЕ
	|	бит_ЛицевыеСчета.Здание.*,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета.*,
	|	бит_ЛицевыеСчета.Квартира.*}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ПостроительЗапроса.Выполнить();
	
	СписокКодовПлательщиков.Очистить();
	
	Если ЗначениеЗаполнено(Улица) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("УлицаЛицевогоСчета");
		ПостроительЗапроса.Отбор["УлицаЛицевогоСчета"].Использование = Истина;
		ПостроительЗапроса.Отбор["УлицаЛицевогоСчета"].ВидСравнения  = ВидСравнения.Равно;
		ПостроительЗапроса.Отбор["УлицаЛицевогоСчета"].Значение      = Улица;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Здание) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("Здание");
		ПостроительЗапроса.Отбор["Здание"].Использование = Истина;
		ПостроительЗапроса.Отбор["Здание"].ВидСравнения  = ВидСравнения.Равно;
		ПостроительЗапроса.Отбор["Здание"].Значение      = Здание;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Квартира) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("Квартира");
		ПостроительЗапроса.Отбор["Квартира"].Использование = Истина;
		ПостроительЗапроса.Отбор["Квартира"].ВидСравнения  = ВидСравнения.Равно;
		ПостроительЗапроса.Отбор["Квартира"].Значение      = Квартира;
		
	КонецЕсли; 
	
	СписокКодовПлательщиков.Загрузить(ПостроительЗапроса.Результат.Выгрузить());
	
КонецПроцедуры

#КонецОбласти
